# 1.Создать список квадратов чисел от 1 до 10 с использованием List Comprehension
print([x**2 for x in range(1, 11)])